ruby/sinatra/ab-puma.out
$ ab -n 500 -c 50 http://localhost:9292/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9292

Document Path:          /
Document Length:        134 bytes

Concurrency Level:      50
Time taken for tests:   0.368 seconds
Complete requests:      500
Failed requests:        0
Write errors:           0
Total transferred:      163500 bytes
HTML transferred:       67000 bytes
Requests per second:    1358.08 [#/sec] (mean)
Time per request:       36.817 [ms] (mean)
Time per request:       0.736 [ms] (mean, across all concurrent requests)
Transfer rate:          433.68 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       5
Processing:     1   33  61.2     12     363
Waiting:        0   29  61.2      8     363
Total:          1   34  61.5     12     368

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     19
  75%     28
  80%     38
  90%     78
  95%    197
  98%    262
  99%    363
 100%    368 (longest request)