ruby/sinatra/ab-puma.out
$ ab -n 500 -c 50 http://localhost:9292/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            9292

Document Path:          /
Document Length:        134 bytes

Concurrency Level:      50
Time taken for tests:   1.843 seconds
Complete requests:      500
Failed requests:        0
Write errors:           0
Total transferred:      163500 bytes
HTML transferred:       67000 bytes
Requests per second:    271.30 [#/sec] (mean)
Time per request:       184.296 [ms] (mean)
Time per request:       3.686 [ms] (mean, across all concurrent requests)
Transfer rate:          86.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.2      0       5
Processing:    13  177 414.8     68    1838
Waiting:       11  176 414.8     67    1838
Total:         13  177 415.7     68    1843

Percentage of the requests served within a certain time (ms)
  50%     68
  66%     79
  75%     86
  80%     94
  90%    137
  95%   1769
  98%   1834
  99%   1840
 100%   1843 (longest request)