ruby/sinatra/ab-thin.out
$ ab -n 500 -c 50 http://localhost:3000/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        thin
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        134 bytes

Concurrency Level:      50
Time taken for tests:   1.011 seconds
Complete requests:      500
Failed requests:        0
Write errors:           0
Total transferred:      185500 bytes
HTML transferred:       67000 bytes
Requests per second:    494.79 [#/sec] (mean)
Time per request:       101.054 [ms] (mean)
Time per request:       2.021 [ms] (mean, across all concurrent requests)
Transfer rate:          179.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       2
Processing:    65   99  11.1     99     129
Waiting:       37   79  12.1     81     113
Total:         65   99  11.2     99     131

Percentage of the requests served within a certain time (ms)
  50%     99
  66%    101
  75%    107
  80%    110
  90%    113
  95%    114
  98%    130
  99%    131
 100%    131 (longest request)