ruby/sinatra/ab-unicorn.out
$ ab -n 500 -c 50 http://localhost:3000/
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        134 bytes

Concurrency Level:      50
Time taken for tests:   0.437 seconds
Complete requests:      500
Failed requests:        0
Write errors:           0
Total transferred:      190000 bytes
HTML transferred:       67000 bytes
Requests per second:    1145.07 [#/sec] (mean)
Time per request:       43.665 [ms] (mean)
Time per request:       0.873 [ms] (mean, across all concurrent requests)
Transfer rate:          424.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.4      0       6
Processing:     3   40   8.0     41      63
Waiting:        1   40   8.1     41      63
Total:          7   41   7.2     42      63

Percentage of the requests served within a certain time (ms)
  50%     42
  66%     44
  75%     45
  80%     45
  90%     46
  95%     49
  98%     54
  99%     59
 100%     63 (longest request)