ruby/sinatra/ab-unicorn.out
$ ab -n 500 -c 50 http://localhost:4567/

This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            4567

Document Path:          /
Document Length:        134 bytes

Concurrency Level:      50
Time taken for tests:   1.776 seconds
Complete requests:      500
Failed requests:        0
Write errors:           0
Total transferred:      190000 bytes
HTML transferred:       67000 bytes
Requests per second:    281.57 [#/sec] (mean)
Time per request:       177.575 [ms] (mean)
Time per request:       3.551 [ms] (mean, across all concurrent requests)
Transfer rate:          104.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       2
Processing:     9  168  28.0    173     201
Waiting:        9  168  28.0    173     201
Total:         11  169  27.6    173     202

Percentage of the requests served within a certain time (ms)
  50%    173
  66%    178
  75%    182
  80%    183
  90%    186
  95%    188
  98%    195
  99%    197
 100%    202 (longest request)